#include <stdio.h>
//题目：企业发放奖金根据利润提成； 
//# 利润低于（？）或等于10万元时，奖金可提成10%； 
//# 利润高于10万元时，低于20万元时，低于10万元的部分按10%提成，高于10万元按7.5%提成； 
//# 20万到40万之间时，高于20万按5%提成； 
//# 40万到60万之间时，高于40万按3%提成； 
//# 60万到100万之间时，高于60万按1.5%提成； 
//# 高于100万时，高于100万的部分按1%提成； 
//输入利润，求应发放的奖金； 
int main(void)
{
	int y = 0;
	int x = 0;
	
	printf("请输入利润");
	scanf("%d",&y);
	
	if(y<100000)//10以下 
	{
		x=y*0.1;
		printf("奖金%d元",x);
	}else if(y<=200000){//10-20
		x=100000*0.1+(y-100000)*0.075;
		printf("奖金%d元",x);
	}else if(y<=400000){//20-40
		x=100000*0.1+100000*0.075+(y-200000)*0.05;
		printf("奖金%d元",x);
	}else if(y<=600000){//40-60
		x=100000*0.1+10000*0.075+200000*0.05+(y-400000)*0.03;
		printf("奖金%d元",x);
	}else if(y<=1000000){//60-100
		x=100000*0.1+10000*0.075+200000*0.05+200000*0.03+(y-600000)*0.015;
		printf("奖金%d元",x);
	}else if(y>1000000){
		x=100000*0.1+10000*0.075+200000*0.05+200000*0.03+400000*0.015+(y-1000000)*0.01;
		printf("奖金%d元",x);
	} 
	
	return 0;
} 
